/****************************************************************************/
/* DL_PrimitiveBoxNode.h													*/
/****************************************************************************/
#ifndef DL_PRIMITIVEBOXNODE_H_
#define	DL_PRIMITIVEBOXNODE_H_

/****************************************************************************/
////////////////////////////////// include ///////////////////////////////////
/****************************************************************************/
#include "DL_PrimitiveCoreNode.h"

/****************************************************************************/
////////////////////////////// Type Declaration //////////////////////////////
/****************************************************************************/
namespace DL
{

//! 箱プリミティブ描画基礎ノード
class C_PrimitiveBoxNode : public C_PrimitiveCoreNode
{
private:
	void _Render(void);

private:
	ACS_S_MEB(private , dlF32 , _degree , Degree);		//< 回転情報
	ACS_S_MEB(private , S_2DBox , _box_S , BoxInfo);	//< 箱情報
};

}

#endif