/****************************************************************************/
/* DL_PrimitivePolygonNode.h												*/
/****************************************************************************/
#ifndef DL_PRIMITIVEPOLYGONNODE_H_
#define	DL_PRIMITIVEPOLYGONNODE_H_

/****************************************************************************/
////////////////////////////////// include ///////////////////////////////////
/****************************************************************************/
#include "DL_PrimitiveCoreNode.h"

/****************************************************************************/
////////////////////////////// Type Declaration //////////////////////////////
/****************************************************************************/
namespace DL
{

//! ポリゴンプリミティブ描画基礎ノード
class C_PrimitivePolygonNode : public C_PrimitiveCoreNode
{
private:
	void _Render(void);

private:
	ACS_S_MEB(private , S_2DPolygon , _polygon_S , PolygonInfo);	//< ポリゴン情報
};

}

#endif
